### Pandas Data Structures

In [1]:
import pandas as pd

### Series

In [2]:
s = pd.Series([45,57,81,35,41,28,94])
s

0    45
1    57
2    81
3    35
4    41
5    28
6    94
dtype: int64

In [3]:
type(s)

pandas.core.series.Series

In [4]:
s.dtype

dtype('int64')

In [5]:
sf = pd.Series([45.12,57.34,81.53,35.48,41.14,28.76,94.07])
sf

0    45.12
1    57.34
2    81.53
3    35.48
4    41.14
5    28.76
6    94.07
dtype: float64

In [6]:
s[4]

41

In [7]:
sf[3]

35.48

In [8]:
s.size

7

In [9]:
s1 = pd.Series([45,57,81,35,41,28,94], index = range(100,107))
s1

100    45
101    57
102    81
103    35
104    41
105    28
106    94
dtype: int64

In [10]:
s1[103]

35

###  DataFrame

In [11]:
r = pd.Series([1,2,3,4,5])
n = pd.Series(['pravin','rani','kiran','ajit','asha'])
m = pd.Series([56.78, 34.67, 87.65, 23.46, 16.98])

In [12]:
df = pd.DataFrame({
    'roll':r,
    'name':n,
    'marks':m
})

In [13]:
df

   roll    name  marks
0     1  pravin  56.78
1     2    rani  34.67
2     3   kiran  87.65
3     4    ajit  23.46
4     5    asha  16.98

In [14]:
type(df)

pandas.core.frame.DataFrame

In [15]:
df.dtypes

roll       int64
name      object
marks    float64
dtype: object

In [16]:
df.shape

(5, 3)

In [17]:
df.size

15

### Structured Data Analysis

# Link: https://mitu.co.in/dataset

In [19]:
#For checking our path
import os
os.getcwd()

'C:\\Users\\duasp\\Analytics & Visualization'

In [20]:
df = pd.read_csv('student.csv')
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [21]:
df1 = pd.read_csv('student1.csv')
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [22]:
cols = ['A','B','C','D','E']
df1 = pd.read_csv('student1.csv', names=cols)
df1

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [23]:
df3 = pd.read_csv('student3.tsv', sep='\t')
df3

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [24]:
df.shape

(10, 5)

In [25]:
df.size

50

In [26]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [27]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [28]:
df.T

,0,1,2,3,4,5,6,7,8,9
roll,1,2,3,4,5,6,7,8,9,10
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,56.77,59.77,76.88,69.66,63.28,49.55,65.34,68.33,56.75,78.66
age,22,21,19,20,20,20,19,23,20,21

In [29]:
df.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [30]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [31]:
df.head(3)

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19

In [32]:
df.tail(3)

   roll   name class  marks  age
7     8  amita    BE  68.33   23
8     9   amol    TE  56.75   20
9    10  anmol    BE  78.66   21

### Data Slicing : Index Based

In [33]:
df.iloc[3:9, 1:4]

      name class  marks
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75

In [34]:
df.iloc[:9, 1:4]

      name class  marks
0     anil    TE  56.77
1     amit    TE  59.77
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75

In [35]:
df.iloc[3:, 1:4]

      name class  marks
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75
9    anmol    BE  78.66

In [36]:
df.iloc[3:, 1:]

      name class  marks  age
3  ajinkya    TE  69.66   20
4     asha    TE  63.28   20
5   ayesha    BE  49.55   20
6     amar    BE  65.34   19
7    amita    BE  68.33   23
8     amol    TE  56.75   20
9    anmol    BE  78.66   21

In [37]:
x = df.iloc[3:, :4]
x

   roll     name class  marks
3     4  ajinkya    TE  69.66
4     5     asha    TE  63.28
5     6   ayesha    BE  49.55
6     7     amar    BE  65.34
7     8    amita    BE  68.33
8     9     amol    TE  56.75
9    10    anmol    BE  78.66

In [38]:
df.iloc[:,:]

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [39]:
df.iloc[:,3]

0    56.77
1    59.77
2    76.88
3    69.66
4    63.28
5    49.55
6    65.34
7    68.33
8    56.75
9    78.66
Name: marks, dtype: float64

In [40]:
df.iloc[5,:]

roll          6
name     ayesha
class        BE
marks     49.55
age          20
Name: 5, dtype: object

In [41]:
df.iloc[[5,3,2,7],:]

   roll     name class  marks  age
5     6   ayesha    BE  49.55   20
3     4  ajinkya    TE  69.66   20
2     3   aniket    BE  76.88   19
7     8    amita    BE  68.33   23

In [42]:
df.iloc[[5,3,2,7],[2,1,0]]

  class     name  roll
5    BE   ayesha     6
3    TE  ajinkya     4
2    BE   aniket     3
7    BE    amita     8

### Data Slicing : Label Based

In [43]:
df.loc[:,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [44]:
df.loc[:,'roll']

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: roll, dtype: int64

In [45]:
df.loc[:,['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [46]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [47]:
df[['name','class','marks']]

      name class  marks
0     anil    TE  56.77
1     amit    TE  59.77
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75
9    anmol    BE  78.66

In [48]:
df.name

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [49]:
df.marks

0    56.77
1    59.77
2    76.88
3    69.66
4    63.28
5    49.55
6    65.34
7    68.33
8    56.75
9    78.66
Name: marks, dtype: float64

In [50]:
# row 0 to 4 & 6 to 9
df.drop(5)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [51]:
df.drop([5,7,6,3])

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19
4     5    asha    TE  63.28   20
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [52]:
df.drop('roll',axis=1)

      name class  marks  age
0     anil    TE  56.77   22
1     amit    TE  59.77   21
2   aniket    BE  76.88   19
3  ajinkya    TE  69.66   20
4     asha    TE  63.28   20
5   ayesha    BE  49.55   20
6     amar    BE  65.34   19
7    amita    BE  68.33   23
8     amol    TE  56.75   20
9    anmol    BE  78.66   21

In [53]:
df.drop(['age','class'],axis=1)

   roll     name  marks
0     1     anil  56.77
1     2     amit  59.77
2     3   aniket  76.88
3     4  ajinkya  69.66
4     5     asha  63.28
5     6   ayesha  49.55
6     7     amar  65.34
7     8    amita  68.33
8     9     amol  56.75
9    10    anmol  78.66

### Functions and Methods

In [54]:
df['marks'].mean()

64.499

In [55]:
df['marks'].median()

64.31

In [56]:
df['marks'].max()

78.66

In [57]:
df['marks'].min()

49.55

In [58]:
df['marks'].sum()

644.9899999999999

In [59]:
df['class'].mode()

0    BE
1    TE
Name: class, dtype: object

In [60]:
df['age'].median()

20.0

In [61]:
df.sum()

roll                                                    55
name     anilamitaniketajinkyaashaayeshaamaramitaamolanmol
class                                 TETEBETETEBEBEBETEBE
marks                                               644.99
age                                                    205
dtype: object

In [62]:
df.min()

roll           1
name     ajinkya
class         BE
marks      49.55
age           19
dtype: object

In [63]:
df.max()

roll         10
name     ayesha
class        TE
marks     78.66
age          23
dtype: object

In [64]:
df.median(numeric_only = True)

roll      5.50
marks    64.31
age      20.00
dtype: float64

In [65]:
df.mean(numeric_only = True)

roll      5.500
marks    64.499
age      20.500
dtype: float64

In [66]:
df['marks'].std()

9.207178901994535

In [67]:
df['marks'].count()

10

In [68]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [69]:
df['class'].value_counts()

class
TE    5
BE    5
Name: count, dtype: int64

In [70]:
df['age'].value_counts()

age
20    4
21    2
19    2
22    1
23    1
Name: count, dtype: int64

In [71]:
df['marks'].value_counts()

marks
56.77    1
59.77    1
76.88    1
69.66    1
63.28    1
49.55    1
65.34    1
68.33    1
56.75    1
78.66    1
Name: count, dtype: int64

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [73]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

### CUSTOM COLUMN OPERATIONS

In [74]:
df['marks']*9

0    510.93
1    537.93
2    691.92
3    626.94
4    569.52
5    445.95
6    588.06
7    614.97
8    510.75
9    707.94
Name: marks, dtype: float64

In [75]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [76]:
#df['marks'] = df['marks'] + 1.0
#df

In [77]:
df['marks'] / 10 + 0.37

0    6.047
1    6.347
2    8.058
3    7.336
4    6.698
5    5.325
6    6.904
7    7.203
8    6.045
9    8.236
Name: marks, dtype: float64

In [78]:
df['cgpa'] = df['marks'] / 10 + 0.5
df

   roll     name class  marks  age   cgpa
0     1     anil    TE  56.77   22  6.177
1     2     amit    TE  59.77   21  6.477
2     3   aniket    BE  76.88   19  8.188
3     4  ajinkya    TE  69.66   20  7.466
4     5     asha    TE  63.28   20  6.828
5     6   ayesha    BE  49.55   20  5.455
6     7     amar    BE  65.34   19  7.034
7     8    amita    BE  68.33   23  7.333
8     9     amol    TE  56.75   20  6.175
9    10    anmol    BE  78.66   21  8.366

In [79]:
x = ['M','M','M','M','F','F','M','F','M','M']
x

['M', 'M', 'M', 'M', 'F', 'F', 'M', 'F', 'M', 'M']

In [80]:
df['gender'] = x
df

   roll     name class  marks  age   cgpa gender
0     1     anil    TE  56.77   22  6.177      M
1     2     amit    TE  59.77   21  6.477      M
2     3   aniket    BE  76.88   19  8.188      M
3     4  ajinkya    TE  69.66   20  7.466      M
4     5     asha    TE  63.28   20  6.828      F
5     6   ayesha    BE  49.55   20  5.455      F
6     7     amar    BE  65.34   19  7.034      M
7     8    amita    BE  68.33   23  7.333      F
8     9     amol    TE  56.75   20  6.175      M
9    10    anmol    BE  78.66   21  8.366      M

### Merge the Dataframes

In [81]:
# merge, join, append, concat

In [82]:
new = pd.DataFrame({
    'roll': range(1,11),
    'cgpa': df['marks'] / 10 + 0.5,
    'gender': ['M','M','M','M','F','F','M','F','M','M']
})

In [83]:
new

   roll   cgpa gender
0     1  6.177      M
1     2  6.477      M
2     3  8.188      M
3     4  7.466      M
4     5  6.828      F
5     6  5.455      F
6     7  7.034      M
7     8  7.333      F
8     9  6.175      M
9    10  8.366      M

In [84]:
df = pd.read_csv('student.csv')
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [85]:
new.columns

Index(['roll', 'cgpa', 'gender'], dtype='object')

In [86]:
newdf = df.merge(new, on='roll')
newdf

   roll     name class  marks  age   cgpa gender
0     1     anil    TE  56.77   22  6.177      M
1     2     amit    TE  59.77   21  6.477      M
2     3   aniket    BE  76.88   19  8.188      M
3     4  ajinkya    TE  69.66   20  7.466      M
4     5     asha    TE  63.28   20  6.828      F
5     6   ayesha    BE  49.55   20  5.455      F
6     7     amar    BE  65.34   19  7.034      M
7     8    amita    BE  68.33   23  7.333      F
8     9     amol    TE  56.75   20  6.175      M
9    10    anmol    BE  78.66   21  8.366      M

In [87]:
df5 = pd.read_csv('student5.csv')
df5

   roll     name class  marks  age
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [88]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [89]:
df5.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [90]:
df5

   roll     name class  marks  age
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

### String Function

In [94]:
df['name'].str.startswith('a')

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
8    True
9    True
Name: name, dtype: bool

In [93]:
df['name'].str.endswith('l')

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
9     True
Name: name, dtype: bool

In [95]:
df['name'].str.find('e')

0   -1
1   -1
2    4
3   -1
4   -1
5    2
6   -1
7   -1
8   -1
9   -1
Name: name, dtype: int64

In [96]:
df['name'].str.repeat(2)

0          anilanil
1          amitamit
2      aniketaniket
3    ajinkyaajinkya
4          ashaasha
5      ayeshaayesha
6          amaramar
7        amitaamita
8          amolamol
9        anmolanmol
Name: name, dtype: object

In [97]:
df['name'].str.replace('i','ee')

0       aneel
1       ameet
2     aneeket
3    ajeenkya
4        asha
5      ayesha
6        amar
7      ameeta
8        amol
9       anmol
Name: name, dtype: object

### Grouping the Data

In [98]:
gr = df.groupby('class')

In [99]:
gr.groups

{'BE': [2, 5, 6, 7, 9], 'TE': [0, 1, 3, 4, 8]}

In [100]:
gr.get_group('BE')

   roll    name class  marks  age
2     3  aniket    BE  76.88   19
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
9    10   anmol    BE  78.66   21

In [103]:
gr.get_group('TE')

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20

In [104]:
gr.min()

       roll     name  marks  age
class
BE        3     amar  49.55   19
TE        1  ajinkya  56.75   20

In [106]:
gr.median(numeric_only = True)

       roll  marks   age
class
BE      7.0  68.33  20.0
TE      4.0  59.77  20.0

### Boolean Filtering

In [111]:
df['marks'] > 60

0    False
1    False
2     True
3     True
4     True
5    False
6     True
7     True
8    False
9     True
Name: marks, dtype: bool

In [112]:
mask = df['marks'] > 60
df[mask]

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [113]:
df[df['marks'] > 60]

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [115]:
x = df[(df['marks'] > 60) & (df['class'] == 'BE')]
x

   roll    name class  marks  age
2     3  aniket    BE  76.88   19
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
9    10   anmol    BE  78.66   21

### Data Export

In [117]:
x.to_csv('output.csv', index = False)